ext_alsav/DataProcessors/УБ_ПечатьТранспортнойНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>УБ_ПечатьТранспортнойНакладной</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_alsav/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаПоАдресу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПолучателюОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Documents/УБ_МаршрутныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УБ_МаршрутныйЛист</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортнаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МобильныйТелефонВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Грузчик3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтветсвенныйЗаОтправкуГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаПринтер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Распоряжение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УБ_РаспоряжениеНаОтгрузку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаПеремещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НазначениеОтправителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказНаПеремещение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасов</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серии</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav/Documents/КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КорректировкаРеализации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаДоходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиДоходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АктОРасхожденияхПослеОтгрузкиОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расхождения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav/DataProcessors/УБ_ПечатьТранспортнойНакладной/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УБ_ТранспортнаяНакладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
						КоллекцияПечатныхФорм,
						"УБ_ТранспортнаяНакладная", "УБ Транспортная накладная",
						СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати, Неопределено, Неопределено));
	КонецЕсли;
	
	//ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати, КомплектыПечати = Неопределено, МА=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТРАНСПОРТНАЯ_НАКЛАДНАЯ";
	
	СтруктураТипов = СоответствиеМассивовПоТипамОбъектовСУчетомДоставки(МассивОбъектов);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл  
		
		Если СтруктураОбъектов.Ключ = "Документ.ЗаданиеНаПеревозку" Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументТН(
			ТабличныйДокумент,
			ДанныеДляПечати,
			ОбъектыПечати,
			КомплектыПечати, МА);
			
			
			Для каждого док из  СтруктураОбъектов.Значение Цикл
			УБ_Модуль.УБ_ЗафиксироватьПечатьВРегистре(Док.Ссылка,ВРЕГ("ТранспортнаяНакладная"));
		КОнецЦикла;	
	КонецЦикла;
	
	//УБ_Аминов)
	//Попытка
	//	Если  Найти(Строка(МассивОбъектов[0]), "Маршрутный дист") <> 0 Тогда
	//		ТабличныйДокумент.ЭкземпляровНаСтранице = 2;
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	//УБ_Аминов)
	
	Возврат ТабличныйДокумент;
КонецФункции

Процедура ЗаполнитьТабличныйДокументТН(ТабличныйДокумент, СтруктураДанных, ОбъектыПечати, КомплектыПечати, МА)
	
	ИсходнМА=МА;
	МА=Документы.УБ_МаршрутныйЛист.ПустаяСсылка();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная");
	
	ТаблицаДанныхДляПечати = СтруктураДанных.ТаблицаРезультата;
	ДанныеСсылкиДокументов = СтруктураДанных.РезультатИменаТоваров.Выбрать();
		
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ТаблицаДанныхДляПечати Цикл
		
		мДок = Новый Массив;
		мДок.Добавить(ДанныеПечати.Ссылка);
		Если Документы.РеализацияТоваровУслуг.ИсключитьДокументыДляПечати_ТН(мДок).Количество() = 0 Тогда
			Продолжить;			
		КонецЕсли;
		
		Если  ИсходнМА=Неопределено Тогда
			//Найдем последний маршрутный лист
			
			//МА=ДанныеПечати.Ссылка.УБ_МаршрутныйЛист;
			МА = ПолучитьМаршрутныйЛистПоРеализации(ДанныеПечати.Ссылка);
			
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
			
		ПервыйДокумент    = Ложь;
		
		Если ТипЗнч(ДанныеПечати.Ссылка)=Тип("ДокументСсылка.УБ_МаршрутныйЛист") Тогда
			ВывестиМаршЛист(ТабличныйДокумент,ДанныеПечати.Ссылка,ОбъектыПечати);
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Для печати комплектов
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
			КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеПечати.Ссылка,"Ссылка");
			Если КомплектПечатиПоСсылке = Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати[0];
			КонецЕсли;
			Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
				Продолжить
			КонецЕсли;
		КонецЕсли;
		
		// Если ТТН с доставкой и нашли связанные с доставкой ошибки - перейдем к следующему документу
		СтруктураЗаданиеНаПеревозку = Новый Структура("НеНайденоЗаданиеНаПеревозку,
													  |БолееОдногоВхожденияВЗаданияНаПеревозку,
													  |РаспоряжениеНеПроведено",
													  Ложь,Ложь,Ложь);
		ЕстьОшибкиДоставки = Ложь;
		ЗаполнитьЗначенияСвойств(СтруктураЗаданиеНаПеревозку,ДанныеПечати);
		
		Если СтруктураЗаданиеНаПеревозку.НеНайденоЗаданиеНаПеревозку Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не найдено задание на перевозку. 
					|Печать формы 1-Т для документов с доставкой возможна после включения документа в задание на перевозку.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		
		Если СтруктураЗаданиеНаПеревозку.БолееОдногоВхожденияВЗаданияНаПеревозку Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Невозможно напечатать форму 1-Т для %1, т.к. найдено более одного задания на перевозку, 
					|в которые включен этот документ.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		
		Если СтруктураЗаданиеНаПеревозку.РаспоряжениеНеПроведено Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 не проведен. Печать товарно - транспортной накладной не будет выполнена.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		
		Если ЕстьОшибкиДоставки Тогда
			Продолжить;
		КонецЕсли;
		
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
		
		ОбластьМакетаОборотная = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
		
		СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата);
		СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
		СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Перевозчик, ДанныеПечати.Дата);
		СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Водитель, ДанныеПечати.Дата);
		
		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		
		
		//УЮ_
		//ОбластьМакета.Параметры.Пункт0_2 = Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy") ; 
		//ОбластьМакета.Параметры.Пункт0_3 = ДанныеПечати.Ссылка.ЗаказКлиента.Номер; 
		
		ОбластьМакета.Параметры.Пункт0_2 = Формат(ДанныеПечати.Ссылка.Дата, "ДФ=dd.MM.yyyy") ; 
		ОбластьМакета.Параметры.Пункт0_3 = ДанныеПечати.Ссылка.Номер; 


		  Вес = 0;
		Для каждого Строч Из ДанныеПечати.Ссылка.Товары Цикл
			   Вес = Вес + Строч.количество * алсав_ПечатьСчет.Вес(Строч.Номенклатура);
			КонецЦикла;
		 		ОбластьМакета.Параметры.Пункт3_3 = "Масса брутто " + Строка(Вес) + " кг."; 

		
		
		Если ДанныеПечати.Грузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ДанныеПечати.Грузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ОбластьМакета.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
		КонецЕсли;
		
		Если ДанныеПечати.Грузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		 Или ДанныеПечати.Грузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
			ОбластьМакета.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ФактическийАдрес,Телефоны");
			ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
			СтруктураПоиска.Вставить("Задание", ДанныеПечати.Задание);
			СтруктураПоиска.Вставить("Порядок", ДанныеПечати.Порядок);
		КонецЕсли;
		
		ИменаТоваров = "";
		Пока ДанныеСсылкиДокументов.НайтиСледующий(СтруктураПоиска) Цикл								
			ИменаТоваров = ИменаТоваров + ДанныеСсылкиДокументов.НаименованиеВидаНоменклатуры + ", ";
		КонецЦикла;			
		
		Если СтрДлина(ИменаТоваров) >= 2 Тогда
			ИменаТоваров = Лев(ИменаТоваров, СтрДлина(ИменаТоваров) - 2);
		КонецЕсли;
		
		ОбластьМакета.Параметры.Пункт3_1 = "Товар по УПД № " + Строка(ДанныеПечати.Ссылка.Номер) + " от " + Строка(Формат(ДанныеПечати.Ссылка.Дата, "ДФ=dd.MM.yyyy"));
		ОбластьМакета.Параметры.Пункт4_1 = "УПД № " + Строка(ДанныеПечати.Ссылка.Номер) + " от " + Строка(Формат(ДанныеПечати.Ссылка.Дата, "ДФ=dd.MM.yyyy"));

		//ОбластьМакета.Параметры.Пункт3_1 = "Товар по УПД № " + Строка(ДанныеПечати.Ссылка.ЗаказКлиента.Номер) + " от " + Строка(Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy"));
		//ОбластьМакета.Параметры.Пункт4_1 = "УПД № " + Строка(ДанныеПечати.Ссылка.ЗаказКлиента.Номер) + " от " + Строка(Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy"));
		
		ОбластьМакета.Параметры.Пункт6_1 = "Московская обл., Осеево д.";//ДанныеПечати.ПунктПогрузки;
		ОбластьМакета.Параметры.Пункт6_5 = Строка(Вес) + " кг."; 
			//Запрос = Новый Запрос;
			//Запрос.Текст =   "ВЫБРАТЬ
			//                 |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо,
			//                 |	МАКСИМУМ(ОтветственныеЛицаОрганизаций.ДатаОкончания) КАК ДатаОкончания
			//                 |ПОМЕСТИТЬ вр
			//                 |ИЗ
			//                 |	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
			//                 |ГДЕ
			//                 |	ОтветственныеЛицаОрганизаций.Должность = &Должность
			//              //   |	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
			//                 |	И ОтветственныеЛицаОрганизаций.Владелец = &Владелец
			//                 |
			//                 |СГРУППИРОВАТЬ ПО
			//                 |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо
			//                 |;
			//                 |
			//                 |////////////////////////////////////////////////////////////////////////////////
			//                 |ВЫБРАТЬ
			//                 |	ОтветственныеЛицаОрганизаций.Ссылка,
			//                 |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо,
			//                 |	ОтветственныеЛицаОрганизаций.ФизическоеЛицо,
			//                 |	ОтветственныеЛицаОрганизаций.ПравоПодписиПоДоверенности,
			//                 |	ОтветственныеЛицаОрганизаций.ОснованиеПраваПодписи
			//                 |ИЗ
			//                 |	вр КАК вр
			//                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
			//                 |		ПО вр.ДатаОкончания = ОтветственныеЛицаОрганизаций.ДатаОкончания
			//                 |ГДЕ
			//                 |	ОтветственныеЛицаОрганизаций.Владелец = &Владелец
			//          //       |	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
			//                 |	И ОтветственныеЛицаОрганизаций.Должность = &Должность";
			//				
			//				Запрос.УстановитьПараметр("Владелец", ДанныеПечати.Организация);
			//				Запрос.УстановитьПараметр("ФизическоеЛицо", МА.ОтветсвенныйЗаОтправкуГруза);
			//				Запрос.УстановитьПараметр("Должность", "Кладовщик");

			//				Выборка = Запрос.Выполнить().Выбрать();
			//				Выборка.Следующий();

			//				Если выборка.Количество() =0 Тогда
			//				    ОбластьМакета.Параметры.Пункт6_6 =  "Зав. складом " + Строка(МА.ОтветсвенныйЗаОтправкуГруза);
			//				Иначе
			//				    ОбластьМакета.Параметры.Пункт6_6 =  "Зав. складом " + Строка(Выборка.ФизическоеЛицо)
			//					+ ", " +  Строка(Выборка.ОснованиеПраваПодписи); //"Приказ № 1АВ от 16.09.16 г";//
			//				КонецЕсли;
						 //ОбластьМакета.Параметры.Пункт6_6 =  Строка(ДанныеПечати.Организация.УБ_ДолжностьКладовщика)+" " + Строка(ДанныеПечати.Организация.УБ_Кладовщик)
						//		+ ", " +  Строка(ДанныеПечати.Организация.УБ_ОснованиеПодписи); //"Приказ № 1АВ от 16.09.16 г";//

//УБ_Комягин
	//Если ДанныеПечати.Организация.Наименование = "ООО ""АЛСАВ""" Тогда
	//	Попытка
	//		ОбластьМакета.Параметры.Пункт6_6 = "Носов С.В.";
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//Если ДанныеПечати.Организация.Наименование = "ООО ""ВСЯ МЕБЕЛЬ""" Тогда
	//	Попытка
	//		ОбластьМакета.Параметры.Пункт6_6 = "Главный бухгалтер Ларионова М.А.";
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//Если ДанныеПечати.Организация.Наименование = "Общество с ограниченной ответственностью ""АВАНС""" Тогда
	//	Попытка
	//		ОбластьМакета.Параметры.Пункт6_6 = "Заместитель генерального директора по складскому хозяйству и АХО Носов С.В.";
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//Если ДанныеПечати.Организация.Наименование = "ООО ""Производственная компания АЛСАВ""" Тогда
	//	Попытка
	//		ОбластьМакета.Параметры.Пункт6_6 = "Генеральный директор Комова А.А.";
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
//УБ_Комягин

	//ОбластьМакета.Параметры.Пункт6_6 = ПолучитьДанные_Пункт6_6(ДанныеПечати.Организация);
	ОбластьМакета.Параметры.Пункт6_6 = "" + ДанныеПечати.ДолжностьКладовщика + " " + ДанныеПечати.Кладовщик; 
								
	//ОбластьМакета.Параметры.Пункт6_6 = Строка(Вес) + " кг.";    Пункт8_4
		ОбластьМакета.Параметры.Пункт6_7 = Ма.Водитель;
 

		
			АдресРазгрузки1 ="";
		Попытка 
			Для каждого Стр из Ма.Маршрут Цикл
				Если ДанныеПечати.Контрагент.Партнер = Стр.Распоряжение.Партнер Тогда
					АдресРазгрузки1 =Стр.Распоряжение.АдресРазгрузки;  //?(АдресРазгрузки1 ="", АдресРазгрузки1 =Стр.Распоряжение.АдресРазгрузки, "; " + АдресРазгрузки1=Стр.Распоряжение.АдресРазгрузки);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Исключение
			//АдресРазгрузки = ДанныеПечати.ПунктРазгрузки;
		КонецПопытки;
		
		Если АдресРазгрузки1 ="" Тогда
			АдресРазгрузки1 = ДанныеПечати.ПунктРазгрузки;
		КонецЕсли;

		
		
		ОбластьМакета.Параметры.Пункт7_1 = АдресРазгрузки1; //ДанныеПечати.ПунктРазгрузки;

		
		ОбластьМакета.Параметры.Пункт8_4 = "Согласно договора"; 
		ОбластьМакета.Параметры.Пункт8_5 = "Согласно договора"; 
		
		
		//Пункт9_1
		
		
		//ОбластьМакета.Параметры.Пункт9_1 = Строка(Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy")); 
		ОбластьМакета.Параметры.Пункт9_1 = Строка(Формат(ДанныеПечати.Ссылка.Дата, "ДФ=dd.MM.yyyy")); 
		ОбластьМакета.Параметры.Пункт9_2 = Ма.Водитель;
		
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Если ДанныеПечати.Перевозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		// Или ДанныеПечати.Перевозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		//ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//	"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			
			Запрос = Новый Запрос;
			Запрос.Текст =   "ВЫБРАТЬ
			                 |	ДокументыФизическихЛиц.Период КАК Период1,
			                 |	ДокументыФизическихЛиц.Физлицо,
			                 |	ДокументыФизическихЛиц.ВидДокумента,
			                 |	ДокументыФизическихЛиц.Серия,
			                 |	ДокументыФизическихЛиц.Номер,
			                 |	ДокументыФизическихЛиц.ДатаВыдачи,
			                 |	ДокументыФизическихЛиц.СрокДействия,
			                 |	ДокументыФизическихЛиц.КемВыдан,
			                 |	ДокументыФизическихЛиц.КодПодразделения,
			                 |	ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность,
			                 |	ДокументыФизическихЛиц.Представление,
			                 |	ДокументыФизическихЛиц.УдалитьВидДокумента
			                 |ИЗ
			                 |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
			                 |ГДЕ
			                 |	ДокументыФизическихЛиц.Физлицо = &Физлицо";
							
							Запрос.УстановитьПараметр("Физлицо", Ма.Водитель);
							
							Выборка = Запрос.Выполнить().Выбрать();
							
							Выборка.Следующий();
							
							
							
							
			//ОбластьМакетаОборотная.Параметры.Пункт10_1 = Строка(Ма.Водитель);
			
		//Иначе
				СведенияОТК      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(МА.ТранспортнаяКомпания, ДанныеПечати.Дата);

			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОТК, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//	ОбластьМакетаОборотная.Параметры.Пункт10_2 = Строка(ДанныеПечати.Водитель) + " " + ПредставлениеПеревозчика;
		//КонецЕсли;
		
		////
		//   ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//		"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//	Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			ОбластьМакетаОборотная.Параметры.Пункт10_1 = Строка(ПредставлениеПеревозчика);

		ОбластьМакетаОборотная.Параметры.Пункт10_3 = Ма.Водитель;
		ОбластьМакетаОборотная.Параметры.Пункт11_1 = Ма.Марка;
		ОбластьМакетаОборотная.Параметры.Пункт11_2 = Ма.ГосНомер;

		
		ПредставлениеВодителя = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Водитель);
		ТелефонВодителя 	  = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			ДанныеПечати.Водитель,
			Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
		
		Если ЗначениеЗаполнено(ТелефонВодителя)
		 И ЗначениеЗаполнено(ПредставлениеВодителя) Тогда
			ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя;
		КонецЕсли;
		
		//ОбластьМакетаОборотная.Параметры.Пункт10_3 = ПредставлениеВодителя;
		
		ГрузоподъемностьВТоннахАвтомобиля      = Формат(ДанныеПечати.ГрузоподъемностьВТоннахАвтомобиля,"");
		ВместимостьВКубическихМетрахАвтомобиля = Формат(ДанныеПечати.ВместимостьВКубическихМетрахАвтомобиля,"");
		
		ИнформацияОбАвтомобиле = ""
			+ ?(ПустаяСтрока(ДанныеПечати.ТипАвтомобиля),"",Строка(ДанныеПечати.ТипАвтомобиля) + ", ")
			+ ?(ПустаяСтрока(ДанныеПечати.МаркаАвтомобиля),"",ДанныеПечати.МаркаАвтомобиля  + ", ")
			+ ?(ПустаяСтрока(ГрузоподъемностьВТоннахАвтомобиля),"",ГрузоподъемностьВТоннахАвтомобиля + " " + НСтр("ru = 'т'")  + ", ")
			+ ?(ПустаяСтрока(ВместимостьВКубическихМетрахАвтомобиля),"",ВместимостьВКубическихМетрахАвтомобиля + " " + НСтр("ru = 'куб. м'"));
		
		ИнформацияОбАвтомобиле = СокрЛП(ИнформацияОбАвтомобиле);
		
		Пока Прав(ИнформацияОбАвтомобиле,1) = "," Цикл
			ИнформацияОбАвтомобиле = Лев(ИнформацияОбАвтомобиле, СтрДлина(ИнформацияОбАвтомобиле)-1)
		КонецЦикла;
		
		//ОбластьМакетаОборотная.Параметры.Пункт16_11 = Строка(Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy")); 
		ОбластьМакетаОборотная.Параметры.Пункт16_11 = Строка(Формат(ДанныеПечати.Ссылка.Дата, "ДФ=dd.MM.yyyy")); 
		ОбластьМакетаОборотная.Параметры.Пункт15_1 = "Согласно договора";;
		
	ОбластьМакетаОборотная.Параметры.Пункт15_6 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование,ИНН,ФактическийАдрес, Телефонф, Банк, Бик, НомерСчета,КоррСчет,");

		
		                           
		
		ОбластьМакетаОборотная.Параметры.Пункт16_1 = Грузоотправитель;
		ОбластьМакетаОборотная.Параметры.Пункт16_2 = Перевозчик;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
		
		// Выведем нужное количество экземпляров (при печати комплектов)
		Если КомплектыПечати <> Неопределено
		 И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено 
		 И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
			ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
			Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьКопирования);
			КонецЦикла;
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанные_Пункт6_6(Организация)
	Возврат "";
КонецФункции

Процедура 	ВывестиМаршЛист(ТабличныйДокумент,ДанныеПечатиСсылка,ОбъектыПечати)
	
	флЭтоПервый=Истина;
	УБЗапрос = Новый Запрос;
	УБЗапрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	РеализацияТоваровУслуг.Организация КАК Организация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.УБ_МаршрутныйЛист = &УБ_МаршрутныйЛист
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.Контрагент
		|ИТОГИ ПО
		|	Контрагент,
		|	Организация,
		|	Ссылка";
	
	УБЗапрос.УстановитьПараметр("УБ_МаршрутныйЛист", ДанныеПечатиСсылка);
	
	УБРезультатЗапроса = УБЗапрос.Выполнить();
	
	УБВыборкаКонтрагент = УБРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока УБВыборкаКонтрагент.Следующий() Цикл
		// Вставить обработку выборки ВыборкаКонтрагент
		УБВыборкаОрганизация = УБВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	 Пока УБВыборкаОрганизация.Следующий() Цикл

		УБВыборкаСсылка = УБВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	     спНакл=Новый СписокЗначений;
		Пока УБВыборкаСсылка.Следующий() Цикл
			// Вставить обработку выборки ВыборкаСсылка
			спНакл.Добавить(УБВыборкаССылка.Ссылка);
		КонецЦикла;
		
		  МА=ДанныеПечатиСсылка;
		  МММ=Новый Массив;
		  МММ.Добавить(спНакл[0].Значение);
		 ДанныеПечати=Документы.РеализацияТоваровУслуг.ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(МММ).ТаблицаРезультата[0];
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
				
			Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная");

		ОбластьМакета = Макет.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона");
		Если Не флЭтоПервый Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		КонецЕсли;
		 флЭтоПервый=Ложь;
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
		
		ОбластьМакетаОборотная = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
		
		СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата);
		СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
		СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Перевозчик, ДанныеПечати.Дата);
		СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Водитель, ДанныеПечати.Дата);
		
		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		
		
		//УЮ_
		//ОбластьМакета.Параметры.Пункт0_2 = Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy") ; 
		//ОбластьМакета.Параметры.Пункт0_3 = ДанныеПечати.Ссылка.ЗаказКлиента.Номер; 
		
		ОбластьМакета.Параметры.Пункт0_2 = "";//Формат(ДанныеПечати.Ссылка.Дата, "ДФ=dd.MM.yyyy") ; 
		ОбластьМакета.Параметры.Пункт0_3 = "";//ДанныеПечати.Ссылка.Номер; 


		  Вес = 0;
		  СписУПД="";
		 Для каждого Эл из спНакл Цикл
		Для каждого Строч Из Эл.Значение.Товары Цикл
			   Вес = Вес + Строч.количество * Строч.Номенклатура.Вес;
		   КонецЦикла;
		   СписУПД=СписУПД+?(СписУПД="","",", ")+  Строка(ДанныеПечати.Номер) + " от " + Строка(Формат(ДанныеПечати.Дата, "ДФ=dd.MM.yyyy"));
	   КонецЦикла;
	   
		 		ОбластьМакета.Параметры.Пункт3_3 = "Масса брутто " + Строка(Вес) + " кг."; 

		
		
		Если ДанныеПечати.Грузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ДанныеПечати.Грузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ОбластьМакета.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
		КонецЕсли;
		
		Если ДанныеПечати.Грузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		 Или ДанныеПечати.Грузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
			ОбластьМакета.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ФактическийАдрес,Телефоны");
			ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
			СтруктураПоиска.Вставить("Задание", ДанныеПечати.Задание);
			СтруктураПоиска.Вставить("Порядок", ДанныеПечати.Порядок);
		КонецЕсли;
		
		ИменаТоваров = "";
		//Пока ДанныеСсылкиДокументов.НайтиСледующий(СтруктураПоиска) Цикл								
		//	ИменаТоваров = ИменаТоваров + ДанныеСсылкиДокументов.НаименованиеВидаНоменклатуры + ", ";
		//КонецЦикла;			
		//
		//Если СтрДлина(ИменаТоваров) >= 2 Тогда
		//	ИменаТоваров = Лев(ИменаТоваров, СтрДлина(ИменаТоваров) - 2);
		//КонецЕсли;
		
		ОбластьМакета.Параметры.Пункт3_1 = "Товар по УПД № " + СписУПД;
		ОбластьМакета.Параметры.Пункт4_1 = "УПД № " + СписУПД;

		//ОбластьМакета.Параметры.Пункт3_1 = "Товар по УПД № " + Строка(ДанныеПечати.Ссылка.ЗаказКлиента.Номер) + " от " + Строка(Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy"));
		//ОбластьМакета.Параметры.Пункт4_1 = "УПД № " + Строка(ДанныеПечати.Ссылка.ЗаказКлиента.Номер) + " от " + Строка(Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy"));
		
		ОбластьМакета.Параметры.Пункт6_1 = "Московская обл., Осеево д.";//ДанныеПечати.ПунктПогрузки;
		ОбластьМакета.Параметры.Пункт6_5 = Строка(Вес) + " кг."; 
			//Запрос = Новый Запрос;
			//Запрос.Текст =   "ВЫБРАТЬ
			//                 |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо,
			//                 |	МАКСИМУМ(ОтветственныеЛицаОрганизаций.ДатаОкончания) КАК ДатаОкончания
			//                 |ПОМЕСТИТЬ вр
			//                 |ИЗ
			//                 |	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
			//                 |ГДЕ
			//                 |	ОтветственныеЛицаОрганизаций.Должность = &Должность
			//          //      |	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
			//                 |	И ОтветственныеЛицаОрганизаций.Владелец = &Владелец
			//                 |
			//                 |СГРУППИРОВАТЬ ПО
			//                 |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо
			//                 |;
			//                 |
			//                 |////////////////////////////////////////////////////////////////////////////////
			//                 |ВЫБРАТЬ
			//                 |	ОтветственныеЛицаОрганизаций.Ссылка,
			//                 |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо,
			//                 |	ОтветственныеЛицаОрганизаций.ФизическоеЛицо,
			//                 |	ОтветственныеЛицаОрганизаций.ПравоПодписиПоДоверенности,
			//                 |	ОтветственныеЛицаОрганизаций.ОснованиеПраваПодписи
			//                 |ИЗ
			//                 |	вр КАК вр
			//                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
			//                 |		ПО вр.ДатаОкончания = ОтветственныеЛицаОрганизаций.ДатаОкончания
			//                 |ГДЕ
			//                 |	ОтветственныеЛицаОрганизаций.Владелец = &Владелец
			//               //  |	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
			//                 |	И ОтветственныеЛицаОрганизаций.Должность = &Должность";
			//				
			//				Запрос.УстановитьПараметр("Владелец", ДанныеПечати.Организация);
			//				Запрос.УстановитьПараметр("ФизическоеЛицо", МА.ОтветсвенныйЗаОтправкуГруза);
			//				Запрос.УстановитьПараметр("Должность", "Кладовщик");

			//				Выборка = Запрос.Выполнить().Выбрать();
			//				Выборка.Следующий();

			//				Если выборка.Количество() =0 Тогда
			//				    ОбластьМакета.Параметры.Пункт6_6 =  "Зав. складом " + Строка(МА.ОтветсвенныйЗаОтправкуГруза);
			//				Иначе
			//				    ОбластьМакета.Параметры.Пункт6_6 =  "Зав. складом " + Строка(Выборка.ФизическоеЛицо)
			//					+ ", " +  Строка(Выборка.ОснованиеПраваПодписи); //"Приказ № 1АВ от 16.09.16 г";//
			//				КонецЕсли;

			
			//ОбластьМакета.Параметры.Пункт6_6 =  Строка(ДанныеПечати.Организация.УБ_ДолжностьКладовщика)+" " + Строка(ДанныеПечати.Организация.УБ_Кладовщик)
			//   				+ ", " +  Строка(ДанныеПечати.Организация.УБ_ОснованиеПодписи); //"Приказ № 1АВ от 16.09.16 г";//
			ОбластьМакета.Параметры.Пункт6_6 = "" + ДанныеПечати.ДолжностьКладовщика + " " + ДанныеПечати.Кладовщик; 
			
	//ОбластьМакета.Параметры.Пункт6_6 = Строка(Вес) + " кг.";    Пункт8_4
		ОбластьМакета.Параметры.Пункт6_7 = Ма.Водитель;
 

		АдресРазгрузки1 ="";
		Попытка 
			Для каждого Стр из Ма.Маршрут Цикл
				Если ДанныеПечати.Контрагент.Партнер = Стр.Распоряжение.Партнер Тогда
					АдресРазгрузки1 =Стр.Распоряжение.АдресРазгрузки;  //?(АдресРазгрузки1 ="", АдресРазгрузки1 =Стр.Распоряжение.АдресРазгрузки, "; " + АдресРазгрузки1=Стр.Распоряжение.АдресРазгрузки);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Исключение
			//АдресРазгрузки = ДанныеПечати.ПунктРазгрузки;
		КонецПопытки;
		
		Если АдресРазгрузки1 ="" Тогда
			АдресРазгрузки1 = ДанныеПечати.ПунктРазгрузки;
		КонецЕсли;

		
		ОбластьМакета.Параметры.Пункт7_1 = АдресРазгрузки1; //ДанныеПечати.ПунктРазгрузки;
		
		ОбластьМакета.Параметры.Пункт8_4 = "Согласно договора"; 
		ОбластьМакета.Параметры.Пункт8_5 = "Согласно договора"; 
		
		
		//Пункт9_1
		
		
		ОбластьМакета.Параметры.Пункт9_1 = Строка(Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy")); 
		ОбластьМакета.Параметры.Пункт9_2 = Ма.Водитель;
		
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Если ДанныеПечати.Перевозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		// Или ДанныеПечати.Перевозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		//ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//	"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			
			Запрос = Новый Запрос;
			Запрос.Текст =   "ВЫБРАТЬ
			                 |	ДокументыФизическихЛиц.Период КАК Период1,
			                 |	ДокументыФизическихЛиц.Физлицо,
			                 |	ДокументыФизическихЛиц.ВидДокумента,
			                 |	ДокументыФизическихЛиц.Серия,
			                 |	ДокументыФизическихЛиц.Номер,
			                 |	ДокументыФизическихЛиц.ДатаВыдачи,
			                 |	ДокументыФизическихЛиц.СрокДействия,
			                 |	ДокументыФизическихЛиц.КемВыдан,
			                 |	ДокументыФизическихЛиц.КодПодразделения,
			                 |	ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность,
			                 |	ДокументыФизическихЛиц.Представление,
			                 |	ДокументыФизическихЛиц.УдалитьВидДокумента
			                 |ИЗ
			                 |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
			                 |ГДЕ
			                 |	ДокументыФизическихЛиц.Физлицо = &Физлицо";
							
							Запрос.УстановитьПараметр("Физлицо", Ма.Водитель);
							
							Выборка = Запрос.Выполнить().Выбрать();
							
							Выборка.Следующий();
							
							
							
							
			//ОбластьМакетаОборотная.Параметры.Пункт10_1 = Строка(Ма.Водитель);
			
		//Иначе
				СведенияОТК      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(МА.ТранспортнаяКомпания, ДанныеПечати.Дата);

			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОТК, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//	ОбластьМакетаОборотная.Параметры.Пункт10_2 = Строка(ДанныеПечати.Водитель) + " " + ПредставлениеПеревозчика;
		//КонецЕсли;
		
		////
		//   ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//		"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//	Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			ОбластьМакетаОборотная.Параметры.Пункт10_1 = Строка(ПредставлениеПеревозчика);

		ОбластьМакетаОборотная.Параметры.Пункт10_3 = Ма.Водитель;
		ОбластьМакетаОборотная.Параметры.Пункт11_1 = Ма.Марка;
		ОбластьМакетаОборотная.Параметры.Пункт11_2 = Ма.ГосНомер;

		
		ПредставлениеВодителя = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Водитель);
		ТелефонВодителя 	  = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			ДанныеПечати.Водитель,
			Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		
		Если ЗначениеЗаполнено(ТелефонВодителя)
		 И ЗначениеЗаполнено(ПредставлениеВодителя) Тогда
			ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя;
		КонецЕсли;
		
		//ОбластьМакетаОборотная.Параметры.Пункт10_3 = ПредставлениеВодителя;
		
		ГрузоподъемностьВТоннахАвтомобиля      = Формат(ДанныеПечати.ГрузоподъемностьВТоннахАвтомобиля,"");
		ВместимостьВКубическихМетрахАвтомобиля = Формат(ДанныеПечати.ВместимостьВКубическихМетрахАвтомобиля,"");
		
		ИнформацияОбАвтомобиле = ""
			+ ?(ПустаяСтрока(ДанныеПечати.ТипАвтомобиля),"",Строка(ДанныеПечати.ТипАвтомобиля) + ", ")
			+ ?(ПустаяСтрока(ДанныеПечати.МаркаАвтомобиля),"",ДанныеПечати.МаркаАвтомобиля  + ", ")
			+ ?(ПустаяСтрока(ГрузоподъемностьВТоннахАвтомобиля),"",ГрузоподъемностьВТоннахАвтомобиля + " " + НСтр("ru = 'т'")  + ", ")
			+ ?(ПустаяСтрока(ВместимостьВКубическихМетрахАвтомобиля),"",ВместимостьВКубическихМетрахАвтомобиля + " " + НСтр("ru = 'куб. м'"));
		
		ИнформацияОбАвтомобиле = СокрЛП(ИнформацияОбАвтомобиле);
		
		Пока Прав(ИнформацияОбАвтомобиле,1) = "," Цикл
			ИнформацияОбАвтомобиле = Лев(ИнформацияОбАвтомобиле, СтрДлина(ИнформацияОбАвтомобиле)-1)
		КонецЦикла;
		
		ОбластьМакетаОборотная.Параметры.Пункт16_11 = Строка(Формат(ДанныеПечати.Ссылка.ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy")); 
		ОбластьМакетаОборотная.Параметры.Пункт15_1 = "Согласно договора";;
		
	ОбластьМакетаОборотная.Параметры.Пункт15_6 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование,ИНН,ФактическийАдрес, Телефонф, Банк, Бик, НомерСчета,КоррСчет,");

		
		                           
		
		ОбластьМакетаОборотная.Параметры.Пункт16_1 = Грузоотправитель;
		ОбластьМакетаОборотная.Параметры.Пункт16_2 = Перевозчик;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
		
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		

		
		
		
		
		
		
		
		
		
		
		
		
		конецЦикла;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры


#КонецОбласти

#КонецОбласти

#КонецЕсли


//Функция раскладывает переданный массив ссылок в соответствие по типам этих ссылок
// с учетом необходимости печатать ТТН и ТН по распоряжениям на доставку из менеджера Задания на перевозку
//
//	Параметры:
//		МассивСсылок - Массив - массив ссылок на объекты информационной базы
//  Возвращаемое значение:
//		Соотвествие:
//			Ключ - полное имя типа ссылки
//			Значение - массив ссылок этого типа
//
Функция СоответствиеМассивовПоТипамОбъектовСУчетомДоставки(МассивСсылок) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	|				Или ДанныеДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА ""Документ.ЗаданиеНаПеревозку""
	|		ИНАЧЕ ""Документ.ПеремещениеТоваров""
	|	КОНеЦ КАК ВидДокумента
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	|				Или ДанныеДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА ""Документ.ЗаданиеНаПеревозку""
	|		ИНАЧЕ ""Документ.РеализацияТоваровУслуг""
	|	КОНеЦ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УБ_МаршрутныйЛист.Ссылка,
	|	""Документ.УБ_МаршрутныйЛист""
	|ИЗ
	|	Документ.УБ_МаршрутныйЛист КАК УБ_МаршрутныйЛист
	|ГДЕ
	|	УБ_МаршрутныйЛист.Ссылка В(&МассивСсылок)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка,
	|	""Документ.КорректировкаРеализации""
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Ссылка В(&МассивСсылок)");
	Запрос.УстановитьПараметр("МассивСсылок",МассивСсылок);
	СоответствиеТипов = Новый Соответствие;
	Для Каждого Стр Из Запрос.Выполнить().Выгрузить() Цикл
		
		ТекущийТипОбъекта = СоответствиеТипов.Получить(Стр.ВидДокумента);
		Если ТекущийТипОбъекта = Неопределено Тогда
			СоответствиеТипов.Вставить(Стр.ВидДокумента, Новый Массив);
			ТекущийТипОбъекта = СоответствиеТипов.Получить(Стр.ВидДокумента);
		КонецЕсли;
		ТекущийТипОбъекта.Добавить(Стр.Ссылка);
		
	КонецЦикла;
	
	Возврат СоответствиеТипов;
	
КонецФункции


Функция ПолучитьМаршрутныйЛистПоРеализации(вхРеализация)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрут.Ссылка КАК МА
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК Реализация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УБ_РаспоряжениеНаОтгрузку.Товары КАК РаспоряжениеНаОтгрузку
	               |		ПО Реализация.ЗаказКлиента = РаспоряжениеНаОтгрузку.ЗаказКлиента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УБ_МаршрутныйЛист.Маршрут КАК Маршрут
	               |		ПО (РаспоряжениеНаОтгрузку.Ссылка = Маршрут.Распоряжение)
	               |ГДЕ
	               |	Реализация.Ссылка = &вхРеализация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Маршрут.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("вхРеализация",вхРеализация);
	
	Рез = ЗАпрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.МА;
	КонецЕсли;
	
КонецФункции
